import re 
text = """Твір — багатофункціональне поняття:

загальний термін для позначення результату інтелектуальної (аналітико-синтетичної
чи еврістичної) діяльності людини (творчої діяльності);
позначення того, що зроблене (створене) ким-небудь і
реально існує (має форму): виріб (витвір, творіння, утвір), опус тощо;
результат інтелектуальної, аналітико-синтетичної чи 
еврістичної діяльності окремої людини чи групи людей, поданий у формі,
що дає змогу його поширення, отримання, зберігання, обробки, відтворення
для використання різними засобами, методами, способами, технологіями.
У юридичному сенсі твір є об'єктом авторського права. У цьому відношенні
твір відрізняється від продукту, який здебільшого є результатом масового 
виробництва (масового відтворення)."""

text = """int main(){ 
    int size;
    cin >> size;
    map<string, int> wordMap;
    int counter = 0;
    int warning = 0;
    for (int i = 0;  i < size; i++){
        string name;
        cin >> name;
        if (wordMap.count(name) > 0){
            wordMap[name] +=1;
        }
        else{
            wordMap[name] = 1;
        }
        counter +=1;

        if (wordMap[name] > 1 && wordMap[name] -1 > counter - wordMap[name]){
            warning +=1;
        }
    } 
    cout <<"\n"<< warning<< endl;
}    
"""

match = re.split(r"[/>,\n]+", text) #split by symbols inside the breckets
print(match)