classmates = ["Бредюк Максим", "Буряківський Сергій", "Вакулюк Іванна", "Ващенко Максим", "Водолєєв Ілля", 
        "Гончарук Андрій", "Джулай Антон", "Диханов Ярослав", "Захарія Денис", "Ісаченко Маргарита", "Клапатюк Максим", "Ковальов Віталій", 
        "Колосов Владислав", "Круть Катерина", "Мец Арсеній", "Миронішин Ігор", "Москаленко В`ячеслав", "Недашківський Павло",
        "Павлюк Василь", "Петриченко Христина", "Романов Владислав", "Сєвєрцев Микола", "Ткаченко Роман", "Хазієв Владлен",
        "Хохлов Дмитро"]